---
kind: type
id: T:Autodesk.Revit.DB.ExportLinetypeInfo
source: html/f7ae5495-2fe3-02be-a803-873ab4b97aa6.htm
---
# Autodesk.Revit.DB.ExportLinetypeInfo

A value used to represent the info stored in the ExportLinetypeTable .

## Syntax (C#)
```csharp
public class ExportLinetypeInfo : IDisposable
```